# DollarPerWH Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..DollarPerWH Property
SymbolTypeId Class See Also
---
Symbol $/(W·h), indicating unit Cost per watt hour.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId DollarPerWH { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DollarPerWH As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DollarPerWH {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace